{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_first", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_25", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 1, 28, 28], "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 32}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_26", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_13", "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_25", "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_13", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "dense_25", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_26", "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"units": 10, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "name": "dense_26", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.1.2"}